# JS-Learning-log

<script type="text/javascript">
	//冒泡排序
	var arr = [3,1,4,2];
	//第一轮比较；3拿出来和其他的数字进行比较
	//1,3,4,2-----3和1比较
	//1,3,4,2-----3和4比较
	//1,2,4,3-----3和2比较
	//第二轮比较；剩下2,4,3进行比较
	//2,4,3-----2和4比较
	//2,4,3-----2和3比较
	//第三轮比较；剩下4,3进行比较
	//3,4-----4和3比较

	//外层循环控制比较的趟数
	//--------------4-1=3-------------0,1,2--比较3次
	for(var i = 0;i<arr.length-1;i++){
		//内层循环控制的是每趟循环的次数
		//arr.length-i 因为每比较完一轮都会排出一个最大/最小的数字，这个数字不需要再参与下一次比较，所以需要减去
		//---------------4-i-1--------4-0-1=3,4-1-1=2,4-2-1=1，
		for(var j = 0;j < arr.length - i - 1;j++){
			//比较大小
			if(arr[j] > arr[j+1]){//arr[j]盘子的数和arr[j+1]盘子的数比较
			var tamp = arr[j+1];//定义一个空的变量先把数组的后一项值保存起来,
			//设一个tamp盒子把比较完的数字装起来，第三个容器；装arr[j+1]中比较完的数，至arr[j+1]中的数倒完--比较完，直至arr[j+1]容器为空
			//console.log(arr[j+1],arr[j]);
			arr[j+1] = arr[j];//把arr[j]盘子里的数倒入空盘子arr[j+1]中
			arr[j] = tamp;//把tamp--第三个容器的数到入arr[j]中
			}
		}
	}
	console.log(arr);
</script>

